module.exports.boDau = new Map([
    //Phiên âm liên quan đến a
    ['á', 'a'],
    ['à', 'a'],
    ['ả', 'a'],
    ['ã', 'a'],
    ['ạ', 'a'],

    //Phiên âm liên quan đến ă
    ['ă', 'a'],
    ['ắ', 'a'],
    ['ằ', 'a'],
    ['ẳ', 'a'],
    ['ẵ', 'a'],
    ['ặ', 'a'],

    //Phiên âm liên quan đến â
    ['â', 'a'],
    ['ấ', 'a'],
    ['ầ', 'a'],
    ['ẩ', 'a'],
    ['ẫ', 'a'],
    ['ậ', 'a'],

    //Phiên âm liên quan đến d
    ['đ', 'd'],

    //Phiên âm liên quan đến e
    ['é', 'e'],
    ['è', 'e'],
    ['ẻ', 'e'],
    ['ẽ', 'e'],
    ['ẹ', 'e'],

    //Phiên âm liên quan đến ê
    ['ê', 'e'],
    ['ế', 'e'],
    ['ề', 'e'],
    ['ể', 'e'],
    ['ễ', 'e'],
    ['ệ', 'e'],

    //Phiên âm liên quan đến i
    ['í', 'i'],
    ['ì', 'i'],
    ['ỉ', 'i'],
    ['ĩ', 'i'],
    ['ị', 'i'],

    //Phiên âm liên quan đến o
    ['ó', 'o'],
    ['ò', 'o'],
    ['ỏ', 'o'],
    ['õ', 'o'],
    ['ọ', 'o'],

    //Phiên âm liên quan đến ô
    ['ô', 'o'],
    ['ố', 'o'],
    ['ồ', 'o'],
    ['ổ', 'o'],
    ['ỗ', 'o'],
    ['ộ', 'o'],

    //Phiên âm liên quan đến ơ
    ['ơ', 'o'],
    ['ớ', 'o'],
    ['ờ', 'o'],
    ['ở', 'o'],
    ['ỡ', 'o'],
    ['ợ', 'o'],

    //Phiên âm liên quan đến u
    ['ú', 'u'],
    ['ù', 'u'],
    ['ủ', 'u'],
    ['ũ', 'u'],
    ['ụ', 'u'],

    //Phiên âm liên quan đến ư
    ['ư', 'u'],
    ['ứ', 'u'],
    ['ừ', 'u'],
    ['ử', 'u'],
    ['ữ', 'u'],
    ['ự', 'u'],

    //Phiên âm liên quan đến y
    ['ý', 'y'],
    ['ỳ', 'y'],
    ['ỷ', 'y'],
    ['ỹ', 'y'],
    ['ỵ', 'y'],

    //UPPERCASE
    //PHIÊN ÂM LIÊN QUAN ĐẾN A
    ['Á', 'A'],
    ['À', 'A'],
    ['Ả', 'A'],
    ['Ã', 'A'],
    ['Ạ', 'A'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Ă
    ['Ă', 'A'],
    ['Ắ', 'A'],
    ['Ằ', 'A'],
    ['Ẳ', 'A'],
    ['Ẵ', 'A'],
    ['Ặ', 'A'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Â
    ['Â', 'A'],
    ['Ấ', 'A'],
    ['Ầ', 'A'],
    ['Ẩ', 'A'],
    ['Ẫ', 'A'],
    ['Ậ', 'A'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN D
    ['Đ', 'D'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN E
    ['É', 'E'],
    ['È', 'E'],
    ['Ẻ', 'E'],
    ['Ẽ', 'E'],
    ['Ẹ', 'E'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Ê
    ['Ê', 'E'],
    ['Ế', 'E'],
    ['Ề', 'E'],
    ['Ể', 'E'],
    ['Ễ', 'E'],
    ['Ệ', 'E'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN I
    ['Í', 'I'],
    ['Ì', 'I'],
    ['Ỉ', 'I'],
    ['Ĩ', 'I'],
    ['Ị', 'I'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN O
    ['Ó', 'O'],
    ['Ò', 'O'],
    ['Ỏ', 'O'],
    ['Õ', 'O'],
    ['Ọ', 'O'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Ô
    ['Ô', 'O'],
    ['Ố', 'O'],
    ['Ồ', 'O'],
    ['Ổ', 'O'],
    ['Ỗ', 'O'],
    ['Ộ', 'O'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Ơ
    ['Ơ', 'O'],
    ['Ớ', 'O'],
    ['Ờ', 'O'],
    ['Ở', 'O'],
    ['Ỡ', 'O'],
    ['Ợ', 'O'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN U
    ['Ú', 'U'],
    ['Ù', 'U'],
    ['Ủ', 'U'],
    ['Ũ', 'U'],
    ['Ụ', 'U'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Ư
    ['Ư', 'U'],
    ['Ứ', 'U'],
    ['Ừ', 'U'],
    ['Ử', 'U'],
    ['Ữ', 'U'],
    ['Ự', 'U'],

    //PHIÊN ÂM LIÊN QUAN ĐẾN Y
    ['Ý', 'Y'],
    ['Ỳ', 'Y'],
    ['Ỷ', 'Y'],
    ['Ỹ', 'Y'],
    ['Ỵ', 'Y'],
]);
